package main

import (
	"math/rand/v2"
	"net/http"
)

var errs = []string{
	"Ой-ой, здається, щось пішло не так. Спробуйте ще раз трохи пізніше.",
	"Упс, наразі я не можу отримати дані. Будь ласка, перевірте з'єднання або спробуйте пізніше.",
	"Здається, у мене виникли технічні труднощі. Поки я контактую з розробником, спитайте щось інше.",
	"На жаль, я стикнувся з проблемою при отриманні даних. Зачекайте кілька хвилин та спробуйте знову.",
	"Вибачте, здається, я не можу обробити ваш запит зараз. Спробуйте знову пізніше.",
	"У мене виникли деякі проблеми з обробкою даних. Будь ласка, спробуйте пізніше.",
	"Помилка отримання даних. Будь ласка, перефразуйте запит.",
	"Непередбачена помилка. Я вже працюю над її вирішенням.",
	"Здається, я втратив зв'язок з джерелом даних. Спробуйте відновити запит пізніше.",
}

func (b *bot) errorResponse(w http.ResponseWriter, err error) {
	b.logger.Error(err.Error())

	resp := errs[rand.IntN(len(errs))]

	err = b.writeResponse(w, resp)

	if err != nil {
		b.logger.Error(err.Error())

		w.WriteHeader(http.StatusInternalServerError)
	}
}
